/* Text explaining that the client will obtain financial information from the current user with a link for more information on which financial information specifically. */
"AddCredentials.Consent.FinancialInformation" = "%@ will obtain some of your financial information. Read More";

/* Title of the Privacy Policy link. This has to match the mention of the Privacy Policy in the `AddCredentials.Consent.ServiceAgreement` string. */
"AddCredentials.Consent.PrivacyPolicy" = "Privacy Policy";

/* Title of the link to more information. This has to match the text for link in the `AddCredentials.Consent.FinancialInformation` string. */
"AddCredentials.Consent.ReadMore" = "Read More";

/* Text explaining that when using the service, the user agrees to Tink's Terms and Conditions and Privacy Policy. */
"AddCredentials.Consent.ServiceAgreement" = "By using the service, you agree to Tink’s Terms and Conditions and Privacy Policy";

/* Title of the Privacy Policy link. This has to match the mention of the Terms and Conditions in the `AddCredentials.Consent.ServiceAgreement` string. */
"AddCredentials.Consent.TermsAndConditions" = "Terms and Conditions";

/* Title for action to continue adding credentials. */
"AddCredentials.Discard.ContinueAction" = "Continue Editing";

/* Title for action to discard adding credentials. */
"AddCredentials.Discard.PrimaryAction" = "Discard Changes";

/* Title for action sheet presented when user tries to dismiss modal while adding credentials. */
"AddCredentials.Discard.Title" = "Are you sure you want to discard this new credential?";

/* Title for error shown when authentication failed while adding credentials. */
"AddCredentials.Error.AuthenticationFailed" = "Authentication failed";

/* Title for error shown when credentials already exists. */
"AddCredentials.Error.CredentialsAlreadyExists" = "Error";

/* Message for error shown when credentials already exists. */
"AddCredentials.Error.CredentialsAlreadyExists.FailureReason" = "You already have a connection to this bank or service.";

/* Title for error shown when a permanent failure occured while adding credentials. */
"AddCredentials.Error.PermanentFailure" = "Permanent error";

/* Title for error shown when a temporary failure occured while adding credentials. */
"AddCredentials.Error.TemporaryFailure" = "Temporary error";

/* Title for button to start authenticating credentials. */
"AddCredentials.Form.Continue" = "Continue";

/* Title for button to open BankID app. */
"AddCredentials.Form.OpenBankID" = "Open BankID";

/* Title for screen where user fills in form to add credentials. */
"AddCredentials.Form.Title" = "Authenticate";

/* Text introducing the descriptions for which data points will be collected when using the service. */
"AddCredentials.ScopeDescriptions.Body" = "By following through this service, we’ll collect financial data from you. These are the data points we will collect from you:";

/* Title for text introducing the descriptions for which data points will be collected when using the service. */
"AddCredentials.ScopeDescriptions.Title" = "We’ll collect the following data from you";

/* Text shown when adding credentials and waiting for authorization. */
"AddCredentials.Status.Authorizing" = "Authorizing…";

/* Title for button to cancel an ongoing task for adding credentials. */
"AddCredentials.Status.Cancel" = "Cancel";

/* Text shown when canceling supplementing information. */
"AddCredentials.Status.Canceling" = "Canceling…";

/* Text shown when submitting supplemental information. */
"AddCredentials.Status.Sending" = "Sending…";

/* Text shown when updating credentials. */
"AddCredentials.Status.Updating" = "Connecting to %@, please wait…";

/* Fallback text shown when fail to get bank name while updating credentials. */
"AddCredentials.Status.Updating.Fallback" = "Connecting, please wait…";

/* Text shown when adding credentials and waiting for authentication on another device. */
"AddCredentials.Status.WaitingForAuthenticationOnAnotherDevice" = "Waiting for authentication on another device";

/* Title for button to dismiss the screen shown when credentials were added successfully. */
"AddCredentials.Success.Confirm" = "Done";

/* Subtitle for screen shown when credentials were added successfully. */
"AddCredentials.Success.Subtitle" = "Your account has successfully connected to %@.";

/* Title for screen shown when credentials were added successfully. */
"AddCredentials.Success.Title" = "Connection successful";

/* Text for the warning shown when the developer is unverified. */
"AddCredentials.Warning.UnverifiedClient" = "Unverified - This solution is only made for development purposes. Do not enter your bank credentials unless you trust the developer.";

/* Title for action to dismiss error alert. */
"Generic.Alert.Dismiss" = "Dismiss";

/* Title for action to confirm alert. */
"Generic.Alert.OK" = "OK";

/* Title generic alert. */
"Generic.Alert.Title" = "Error";

/* Text used to form a list. */
"Generic.Formatter.And" = "and";

/* Title for error alert if error doesn't contain a description. */
"Generic.ServiceAlert.FallbackTitle" = "The service is unavailable at the moment.";

/* Title for action to retry a failed request. */
"Generic.ServiceAlert.Retry" = "Retry";

/* Text describing the group of providers that use Open Banking. */
"ProviderPicker.AccessType.OpenBankingDetail" = "Including everyday accounts, such as your salary account.";

/* Title for the group of providers that use Open Banking. */
"ProviderPicker.AccessType.OpenBankingTitle" = "Checking accounts";

/* Text describing the group of providers that does not use Open Banking. */
"ProviderPicker.AccessType.OtherDetail" = "Including saving accounts, credit cards, loans, investments and your personal information.";

/* Title for the group of providers that does not use Open Banking. */
"ProviderPicker.AccessType.OtherTitle" = "Other account types";

/* Description of the provider capability Checking Accounts. */
"ProviderPicker.Capability.CheckingAccounts" = "Checking Accounts";

/* Description of the provider capability Credit Cards. */
"ProviderPicker.Capability.CreditCards" = "Credit Cards";

/* Description of the provider capability E-Invoices. */
"ProviderPicker.Capability.EInvoices" = "E-Invoices";

/* Description of the provider capability Identity Data. */
"ProviderPicker.Capability.IdentityData" = "Identity Data";

/* Description of the provider capability Investments. */
"ProviderPicker.Capability.Investments" = "Investments";

/* Description of the provider capability Loans. */
"ProviderPicker.Capability.Loans" = "Loans";

/* Description of the provider capability Mortgage Aggregation. */
"ProviderPicker.Capability.MortgageAggregation" = "Mortgage Aggregation";

/* Description of the provider capability Mortgage Loan. */
"ProviderPicker.Capability.MortgageLoan" = "Mortgage Loan";

/* Description of the provider capability Payments. */
"ProviderPicker.Capability.Payments" = "Payments";

/* Description of the provider capability Savings Accounts. */
"ProviderPicker.Capability.SavingsAccounts" = "Savings Accounts";

/* Description of the provider capability Transfers. */
"ProviderPicker.Capability.Transfers" = "Transfers";

/* Description for error when providers could not be loaded. */
"ProviderPicker.Error.Description" = "We are informed of this error and are working hard to resolve it. Bear with us, and try again a bit later.";

/* Title for button to try loading providers again. */
"ProviderPicker.Error.RetryButton" = "Try again";

/* Description for error when providers could not be loaded and it is likely it's a temporary error. */
"ProviderPicker.Error.Temporary" = "This could be a temporary error, please try again and see if the problem persists.";

/* Title for when providers could not be loaded. */
"ProviderPicker.Error.Title" = "We’re sorry, but we couldn't load any banks at the moment";

/* Title for screen where user selects which access type to use when adding credentials. */
"ProviderPicker.List.AccessTypeTitle" = "Add %@";

/* Title for screen where user selects which authentication type to use when adding credentials. */
"ProviderPicker.List.CredentialsTypeTitle" = "Sign in method";

/* Title for list of all providers. */
"ProviderPicker.List.FinancialInstitutionsTitle" = "Choose bank";

/* Placeholder in search field shown in provider list. */
"ProviderPicker.List.SearchPlaceholder" = "Search for a bank or card";

/* Title for button to send supplemental information when adding credentials. */
"SupplementalInformation.Form.Submit" = "Done";

/* Title for form asking user to supplement information when adding credentials. */
"SupplementalInformation.Form.Title" = "Supplemental Information";

/* Description shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeDescription" = "Open the Mobile Bank ID app and scan this QR code to authenticate.";

/* Title shown for QR code in the supplemental information dialog. */
"SupplementalInformation.QRCodeTitle" = "Open the BankID app";

/* Title for action to cancel downloading app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Cancel" = "Cancel";

/* Title for action to confirm alert requesting download of third-party authentication app when AppStore URL could not be opened. */
"ThirdPartyAppAuthentication.DownloadAlert.Dismiss" = "OK";

/* Title for action to download app for third-party app authentication. */
"ThirdPartyAppAuthentication.DownloadAlert.Download" = "Download";

